cases/submerged/rotational_z/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{{
	format		ascii;
	class		dictionary;
	object		blockMeshDict;
}}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

zmin {lb:.12f};
zmax {ub:.12f};
neglinner {lb_inner:.12f};
linner {ub_inner:.12f};

radius {radius:.12f};
negradius {negative_radius:.12f};
trigradius {sin45_radius:.12f};
negtrigradius {negative_sin45_radius:.12f};

zcells {resolution:d};
radialcellshalf {resolution_half:d};
radialcellsquarter {resolution_quarter:d};

vertices        
(
	($neglinner $neglinner $zmin)
	($linner    $neglinner $zmin)
	($linner    $linner    $zmin)
	($neglinner $linner    $zmin)
	($neglinner $neglinner $zmax)
	($linner    $neglinner $zmax)
	($linner    $linner    $zmax)
	($neglinner $linner    $zmax)    
    
	($negtrigradius $negtrigradius $zmin)
	($trigradius    $negtrigradius $zmin)
	($trigradius    $trigradius    $zmin)
	($negtrigradius $trigradius    $zmin)    
	($negtrigradius $negtrigradius $zmax)
	($trigradius    $negtrigradius $zmax)
	($trigradius    $trigradius    $zmax)
	($negtrigradius $trigradius    $zmax) 
);

blocks          
(
	hex ( 0  1  2  3  4  5  6  7) all ($radialcellshalf $radialcellshalf    $zcells) simpleGrading (1 1 1)
	hex ( 8  9  1  0 12 13  5  4) all ($radialcellshalf $radialcellsquarter $zcells) simpleGrading (1 1 1)
	hex ( 9 10  2  1 13 14  6  5) all ($radialcellshalf $radialcellsquarter $zcells) simpleGrading (1 1 1)
	hex (10 11  3  2 14 15  7  6) all ($radialcellshalf $radialcellsquarter $zcells) simpleGrading (1 1 1)
	hex (11  8  0  3 15 12  4  7) all ($radialcellshalf $radialcellsquarter $zcells) simpleGrading (1 1 1)
);

edges           
(
	arc  8  9 (0          $negradius $zmin)
	arc  9 10 ($radius    0          $zmin)
	arc 10 11 (0          $radius    $zmin)
	arc 11  8 ($negradius 0          $zmin)
	arc 12 13 (0          $negradius $zmax)
	arc 13 14 ($radius    0          $zmax)
	arc 14 15 (0          $radius    $zmax)
	arc 15 12 ($negradius 0          $zmax)
);

boundary        
(
    minZ
    {{
        type wall;
	faces
	( 
            (0 1 2 3)
            (8 9 1 0) 
            (9 10 2 1)
            (10 11 3 2)
            (11 8 0 3)
	);
    }}

    maxZ
    {{
        type wall;
	faces
	( 
            (4 5 6 7)
            (12 13 5 4)
            (13 14 6 5)
            (14 15 7 6)
            (15 12 4 7)
	);
    }}

    outside
    {{
        type wall;
	faces
	( 
            (8 9 12 13)
            (9 10 13 14)
            (10 11 14 15)
            (11 8 15 12)
	);
    }}
);

mergePatchPairs 
(
);

